Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/timer_reg.h
struct timer_reg {
    /* 0x0 : TCCR */
    union {
        struct
        {
            uint32_t reserved_0_1   : 2;  /* [ 1: 0],       rsvd,        0x0 */
            uint32_t cs_1           : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t RESERVED_4     : 1;  /* [    4],       rsvd,        0x0 */
            uint32_t cs_2           : 2;  /* [ 6: 5],        r/w,        0x0 */
            uint32_t RESERVED_7     : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t cs_wdt         : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_31 : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TCCR;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[12];

    /* 0x10 : TMR2_0 */
    union {
        struct
        {
            uint32_t tmr : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } TMR2_0;

    /* 0x14 : TMR2_1 */
    union {
        struct
        {
            uint32_t tmr : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } TMR2_1;

    /* 0x18 : TMR2_2 */
    union {
        struct
        {
            uint32_t tmr : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } TMR2_2;

    /* 0x1C : TMR3_0 */
    union {
        struct
        {
            uint32_t tmr : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } TMR3_0;

    /* 0x20 : TMR3_1 */
    union {
        struct
        {
            uint32_t tmr : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } TMR3_1;

    /* 0x24 : TMR3_2 */
    union {
        struct
        {
            uint32_t tmr : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } TMR3_2;

    /* 0x28  reserved */
    uint8_t RESERVED0x28[4];

    /* 0x2C : TCR2 */
    union {
        struct
        {
            uint32_t tcr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } TCR2;

    /* 0x30 : TCR3 */
    union {
        struct
        {
            uint32_t tcr3_counter : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } TCR3;

    /* 0x34  reserved */
    uint8_t RESERVED0x34[4];

    /* 0x38 : TMSR2 */
    union {
        struct
        {
            uint32_t tmsr_0        : 1;  /* [    0],          r,        0x0 */
            uint32_t tmsr_1        : 1;  /* [    1],          r,        0x0 */
            uint32_t tmsr_2        : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TMSR2;

    /* 0x3C : TMSR3 */
    union {
        struct
        {
            uint32_t tmsr_0        : 1;  /* [    0],          r,        0x0 */
            uint32_t tmsr_1        : 1;  /* [    1],          r,        0x0 */
            uint32_t tmsr_2        : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TMSR3;

    /* 0x40  reserved */
    uint8_t RESERVED0x40[4];

    /* 0x44 : TIER2 */
    union {
        struct
        {
            uint32_t tier_0        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tier_1        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tier_2        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TIER2;

    /* 0x48 : TIER3 */
    union {
        struct
        {
            uint32_t tier_0        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tier_1        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tier_2        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TIER3;

    /* 0x4c  reserved */
    uint8_t RESERVED0x4c[4];

    /* 0x50 : TPLVR2 */
    union {
        struct
        {
            uint32_t tplvr : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } TPLVR2;

    /* 0x54 : TPLVR3 */
    union {
        struct
        {
            uint32_t tplvr : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } TPLVR3;

    /* 0x58  reserved */
    uint8_t RESERVED0x58[4];

    /* 0x5C : TPLCR2 */
    union {
        struct
        {
            uint32_t tplcr         : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TPLCR2;

    /* 0x60 : TPLCR3 */
    union {
        struct
        {
            uint32_t tplcr         : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TPLCR3;

    /* 0x64 : WMER */
    union {
        struct
        {
            uint32_t we            : 1;  /* [    0],        r/w,        0x0 */
            uint32_t wrie          : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WMER;

    /* 0x68 : WMR */
    union {
        struct
        {
            uint32_t wmr            : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WMR;

    /* 0x6C : WVR */
    union {
        struct
        {
            uint32_t wvr            : 16; /* [15: 0],          r,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WVR;

    /* 0x70 : WSR */
    union {
        struct
        {
            uint32_t wts           : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WSR;

